[
  {
    "name": "Raywatie Gocool",
    "jobTitle": "Executive Director / Licensed Clinical Social Worker",
    "description": "Raywatie Gocool is a Licensed Clinical Social Worker in New Jersey and the Executive Director of Irvington Counseling Center. She holds both bachelor's and master's degrees in social work from Rutgers University. Raywatie has extensive experience providing mental health and substance abuse counseling, including work in the criminal justice system. Her expertise includes anxiety, stress, depression, relationship issues, grief, and anger management. She is dedicated to helping individuals find the tools they need for a healthier and happier life, using Cognitive Behavioral Therapy, Solution Focused Therapy, and Person-Centered Therapy.",
    "experience": [
      "Executive Director at Irvington Counseling Center: Provides leadership and clinical supervision.",
      "Licensed Clinical Social Worker: Specializes in CBT, Solution Focused, and Person-Centered Therapy.",
      "Mental health and substance abuse counseling in the criminal justice system since 2013.",
      "Expertise in anxiety, depression, relationship issues, grief, and anger management."
    ],
    "pictureUrl": "../img/team/1.jpeg"
  },
  {
    "name": "Adara Kimbrough",
    "jobTitle": "Senior Staff Clinician / Licensed Social Worker",
    "description": "Adara Kimbrough is a Licensed Social Worker and Senior Staff Clinician at Irvington Counseling Center. She is a compassionate therapist committed to helping clients improve their mental health through CBT and mindfulness techniques. Adara supports clients facing depression, anxiety, and stress, and is dedicated to providing a supportive and empathetic environment.",
    "experience": [
      "Senior Staff Clinician at Irvington Counseling Center.",
      "Licensed Social Worker specializing in CBT and mindfulness techniques.",
      "Experience supporting clients with depression, anxiety, and stress."
    ],
    "pictureUrl": "../img/team/5.jpeg"
  },
  {
    "name": "Amanda Barreto",
    "jobTitle": "Staff Clinician / MSW",
    "description": "Amanda Barreto, MSW, is a dedicated Master's-level mental health counselor at Irvington Counseling Center. She provides individualized supportive counseling to clients of all ages facing a range of mental health challenges. Amanda is passionate about promoting mental well-being and empowering clients to navigate life's difficulties with resilience and confidence.",
    "experience": [
      "Staff Clinician at Irvington Counseling Center.",
      "Master's in Social Work (MSW).",
      "Experience providing supportive counseling for diverse mental health challenges."
    ],
    "pictureUrl": "../img/team/6.jpeg"
  },
  {
    "name": "Maria Elliot Francis",
    "jobTitle": "Staff Clinician / Crisis Screener",
    "description": "Maria Elliot Francis is a dedicated therapist and State of New Jersey Crisis Screener at Irvington Counseling Center. She has extensive experience in individual, family, group, and marriage therapy, working in school systems, hospitals, and community mental health settings. Maria is committed to fostering growth and well-being for individuals and families.",
    "experience": [
      "Staff Clinician and Crisis Screener at Irvington Counseling Center.",
      "Experience in individual, family, group, and marriage therapy.",
      "Work in school systems, hospitals, and community mental health settings."
    ],
    "pictureUrl": "../img/team/7.jpeg"
  },
  {
    "name": "George Kwantwi Barimah",
    "jobTitle": "Staff Clinician / Social Worker / Counselor / Case Manager",
    "description": "George Kwantwi Barimah is a highly skilled Social Worker, Counselor, and Case Manager at Irvington Counseling Center. He has over 12 years of experience in mental health and substance abuse, working in hospital systems and supporting clients of all ages. George specializes in anger management, couples and family counseling, and helping those struggling with anxiety, depression, and stress.",
    "experience": [
      "Staff Clinician, Social Worker, Counselor, and Case Manager at Irvington Counseling Center.",
      "Over 12 years of experience in mental health and substance abuse.",
      "Expertise in anger management, couples and family counseling, and crisis intervention."
    ],
    "pictureUrl": "../img/team/8.jpeg"
  },
  {
    "name": "Skiyetta Torres",
    "jobTitle": "Staff Clinician / MSW",
    "description": "Skiyetta Torres is a Staff Clinician at Irvington Counseling Center. She is a bilingual professional with a Master of Social Work from Seton Hall University and a background in psychology, criminology, and sociology. Skiyetta has experience as a substance abuse counselor, school counselor, and is certified in trauma and exposure therapies. She is dedicated to empowering others and creating meaningful change.",
    "experience": [
      "Staff Clinician at Irvington Counseling Center.",
      "Master of Social Work from Seton Hall University.",
      "Experience in substance abuse counseling, school counseling, and trauma/exposure therapies."
    ],
    "pictureUrl": "../img/team/9.jpeg"
  },
  {
    "name": "Rio Scarcelli",
    "jobTitle": "Staff Clinician",
    "description": "Rio Scarcelli is a Staff Clinician at Irvington Counseling Center. He has worked in counseling since 2021, with experience in family therapy, one-on-one counseling, and working with youth at autism centers. Rio is skilled in severe mental illnesses, adjustment disorders, anger management, and supporting clients with anxiety and depression. He holds a Bachelor's degree from Duquesne University and is pursuing a Master's in Clinical Psychology at Montclair State University.",
    "experience": [
      "Staff Clinician at Irvington Counseling Center since 2021.",
      "Experience in family therapy, individual counseling, and autism centers.",
      "Bachelor's from Duquesne University; pursuing Master's in Clinical Psychology at Montclair State University."
    ],
    "pictureUrl": "../img/team/10.png"
  },
  {
    "name": "Femi Omidire",
    "jobTitle": "Psychiatric APN / Nurse Practitioner",
    "description": "Femi Omidire is a Psychiatric Mental Health Nurse Practitioner at Irvington Counseling Center with over 5 years of experience. He has served as Assistant Director of the Behavioral Unit at Bergen New Bridge Medical Center and has worked in various settings, including partial hospitalization, outpatient, detox, and rehabilitation. Femi specializes in treating a wide range of mental health disorders and is passionate about serving his community.",
    "experience": [
      "Psychiatric APN at Irvington Counseling Center.",
      "Over 5 years of experience as a Psychiatric Mental Health Nurse Practitioner.",
      "Assistant Director of Behavioral Unit at Bergen New Bridge Medical Center for 7 years.",
      "Experience in partial hospitalization, outpatient, detox, and rehabilitation settings."
    ],
    "pictureUrl": "../img/team/11.jpeg"
  },
  {
    "name": "Prisca Ogbonaya",
    "jobTitle": "Psychiatric APN / Nurse Practitioner",
    "description": "Prisca Ogbonaya is a Psychiatric Mental Health Nurse Practitioner at Irvington Counseling Center with 2 years of experience. She has worked in inpatient and outpatient psychiatric care, collaborating with individuals and families facing mental health and substance abuse challenges. Prisca is proficient in patient care and tele-psychiatry and is dedicated to advocating for her patients with compassion and holistic care.",
    "experience": [
      "Psychiatric APN at Irvington Counseling Center.",
      "2 years of experience as a Psychiatric Mental Health Nurse Practitioner.",
      "Experience in inpatient and outpatient psychiatric care, and tele-psychiatry.",
      "Advocates for patients with compassion and holistic care."
    ],
    "pictureUrl": "../img/team/12.png"
  },
  {
    "name": "Tracey Orner",
    "jobTitle": "Administrative Assistant / Billing Manager",
    "description": "Tracey Orner is the Administrative Assistant and Billing Manager at Irvington Counseling Center. She holds a BA in Business Management from Rutgers, NCAS. Tracey has decades of experience in business management, payroll, and billing, including 29 years with the Township of Irvington. She is dedicated to giving back to the Irvington community and finds fulfillment in supporting an organization that helps so many people.",
    "experience": [
      "Administrative Assistant/Billing Manager at Irvington Counseling Center since 2011.",
      "Payroll Supervisor for the Township of Irvington for 29 years.",
      "BA in Business Management from Rutgers, NCAS."
    ],
    "pictureUrl": "../img/team/2.jpeg"
  },
  {
    "name": "Rhona Duncan",
    "jobTitle": "Receptionist",
    "description": "Rhona Duncan has been the Front Desk Receptionist at Irvington Counseling Center for 9 years. She is highly experienced in customer service and administrative support, and is known for her reliability and dedication as a team player.",
    "experience": [
      "Receptionist at Irvington Counseling Center for 9 years.",
      "Experienced in customer service and administrative support.",
      "Dedicated and reliable team player."
    ],
    "pictureUrl": "../img/team/3.jpeg"
  },
  {
    "name": "Andrew Singh",
    "jobTitle": "Office Assistant",
    "description": "Andrew Singh is the Office Assistant at Irvington Counseling Center. He holds a Bachelor's and Master's in Business Administration from Saint Peter's University. Andrew began as a receptionist in 2021 and now assists with office operations. He enjoys connecting with the community and helping people reach their goals.",
    "experience": [
      "Office Assistant at Irvington Counseling Center since 2021.",
      "Receptionist at Irvington Counseling Center.",
      "Bachelor's and Master's in Business Administration from Saint Peter's University."
    ],
    "pictureUrl": "../img/team/4.jpeg"
  }
]
